<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"b44ca4fdf95112e36d06b6270f63cfeb93cd00c35dcb81adfc7bf1f2364dba58","plan_job_ref":"Job Staging Environment #94 at https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9733118127","plan_out_hash":"4f9e10d54360005cbd73064c35fd887db68f02f9f151265151f65eeadc1e5b10","plan_hash":"3f2c71c8af2b7965b0638568c0e2319a217d7e63074c1542406d53bde42f103a","plan_text_format":"diff","version":"1.43.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.site-iam-policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "site-iam-policy" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:GetObject",
+               "s3:ListBucket",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:s3:::dev-portfolio-website-2.0",
+               "arn:aws:s3:::dev-portfolio-website-2.0/*",
            ]
+           sid       = "Allowing Cloudfront to access private S3 Bucket"

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ",
                ]
+               variable = "AWS:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "cloudfront.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
!~  resource "aws_cloudfront_distribution" "s3_distribution" {
        id                              = "EOUIG3G6N7CQQ"
        tags                            = {}
#        (23 unchanged attributes hidden)

!~      viewer_certificate {
!~          cloudfront_default_certificate = false -> true
#            (4 unchanged attributes hidden)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.site-bucket-policy will be updated in-place
!~  resource "aws_s3_bucket_policy" "site-bucket-policy" {
        id     = "dev-portfolio-website-2.0"
!~      policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Condition = {
-                           StringEquals = {
-                               "AWS:SourceArn" = "arn:aws:cloudfront::806066816337:distribution/EOUIG3G6N7CQQ"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "cloudfront.amazonaws.com"
                        }
-                       Resource  = [
-                           "arn:aws:s3:::dev-portfolio-website-2.0/*",
-                           "arn:aws:s3:::dev-portfolio-website-2.0",
                        ]
-                       Sid       = "Allowing Cloudfront to access private S3 Bucket"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # aws_s3_object.cert will be updated in-place
!~  resource "aws_s3_object" "cert" {
!~      etag                          = "73b6ddb3002ad239d1e22c29dcf1cd99" -> "da23af711c3e6200e1b72dcfe729cb3d"
        id                            = "cert.html"
        tags                          = {}
!~      version_id                    = "********************************" -> (known after apply)
#        (23 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Environment #94](https://github.com/IrezD/cloud-s3-website-with-cicd-pipeline-v2.0/actions/runs/9733118127)